
==========COMMAND START: restoredb==========
/opt/dcelocal/bin/rpccp show group /.:/subsys/dce/dfs/bak

group members:

  /.../power2.dce.transarc.com/hosts/power2/self
  /.../power2.dce.transarc.com/hosts/power8/self

/opt/dcelocal/bin/bos status /.:/hosts/power2 bakserver
Instance bakserver, currently running normally.
/opt/dcelocal/bin/bos status /.:/hosts/power8 bakserver
Instance bakserver, currently running normally.
hostname
power8.transarc.com
/bin/rm -rf /opt/dcelocal/var/dfs/backup/restoredb-cmd
/bin/mkdir /opt/dcelocal/var/dfs/backup/restoredb-cmd
/bin/cp /opt/dcelocal/var/dfs/backup/bkdb.DB0 /opt/dcelocal/var/dfs/backup/bkdb.DBSYS1 /opt/dcelocal/var/dfs/backup/restoredb-cmd
/opt/dcelocal/bin/bos stop /.:/hosts/power2 bakserver
/opt/dcelocal/bin/bos stop /.:/hosts/power8 bakserver
spawn telnet power2 
Trying...
Connected to power2.transarc.com.
Escape character is '^]'.


telnet (power2)


























AIX Version 3
(C) Copyrights by IBM and by others 1982, 1993.
login: rootl
rootl's Password:

        This is POWER2, a DFS Development RS/6000.
        It sits in room 1901.

        11/18/94 shl    Installed AIX 3.2.5 + AFS 3.3a
                        + Austin-recommended PTFs for DCE 1.3


Last unsuccessful login: Wed Nov  6 19:16:20 EST 1996 on pts/1 from 129.35.102.89
Last login: Fri Nov  8 16:09:32 EST 1996 on pts/8 from power8.transarc.com
# sleep 10
/bin/csh
# set prompt="##TEST## "
##TEST## /bin/rm /opt/dcelocal/var/dfs/backup/bkdb.DB0 /opt/dcelocal/var/dfs/backup/bkdb.DBSYS1
##TEST## /bin/echo $status
0
##TEST## spawn telnet power8 
Trying...
Connected to power8.transarc.com.
Escape character is '^]'.


AIX telnet (power8.transarc.com)


























AIX Version 3
(C) Copyrights by IBM and by others 1982, 1993.
login: rootl
rootl's Password:
*******************************************************************************
*                       Welcome to AIX Version 3.2!                           *
*                                                                             *
*******************************************************************************

        This is power8.transarc.com and belongs to DFS Group.

        Please contact Srinivas Kotla (x6863) for any questions.



Last unsuccessful login: Tue Oct 29 11:49:57 1996 on pts/4 from 129.35.102.68
Last login: Fri Nov  8 15:10:15 1996 on pts/14
# sleep 10
/bin/csh
# set prompt="##TEST## "
##TEST## /bin/rm /opt/dcelocal/var/dfs/backup/bkdb.DB0 /opt/dcelocal/var/dfs/backup/bkdb.DBSYS1
##TEST## /bin/echo $status
0
##TEST## /opt/dcelocal/bin/bos start /.:/hosts/power2 bakserver
/opt/dcelocal/bin/bos start /.:/hosts/power8 bakserver
sleep 200
spawn /opt/dcelocal/bin/bak 
bak> jobs
bak> addhost /.../power2.dce.transarc.com/hosts/power8 0
Adding host '/.../power2.dce.transarc.com/hosts/power8' offset 0 to tape list...done
bak> addftfamily restoredb_test
bak> addftentry restoredb_test /.../power2.dce.transarc.com/hosts/power8 epi1 .*
bak> adddump /restoredb_test_full
bak: Created new dump schedule /restoredb_test_full
bak> adddump /restoredb_test_full/incr1
bak: Created new dump schedule /restoredb_test_full/incr1
bak> adddump /restoredb_test_full/incr1/incr11
bak: Created new dump schedule /restoredb_test_full/incr1/incr11
bak> adddump /restoredb_test_full/incr2
bak: Created new dump schedule /restoredb_test_full/incr2
bak> lshosts
Tape hosts:
    Host /.../power2.dce.transarc.com/hosts/power8, port offset 0
bak> lsftfamilies
Fileset family restoredb_test:
    Entry   1: server /.../power2.dce.transarc.com/hosts/power8, aggregate epi1, filesets: .*

bak> lsdumps
/restoredb_test_full 
    /incr1 
        /incr11 
    /incr2 
bak> spawn /opt/dcelocal/bin/butc -tcid 0 
Opened file /opt/dcelocal/var/dfs/backup/conf__opt_dcelocal_var_dfs_backup_DEVICE_link
Tape mount callout routine is /opt/dcelocal/var/dfs/backup/DEVICE/mount.sh
Tape unmount callout routine is /opt/dcelocal/var/dfs/backup/DEVICE/unmount.sh
Operator queries are disabled
Dump tape name check is enabled
Will dump to a file
Tape Coordinator:  TCID 0   Debug level 0   Cell /.../power2.dce.transarc.com
Butc started on  at tcid 0sleep 15
status -tcid 0
Tape coordinator is idle
bak> labeltape   -tcid 0
bak> Path=/opt/dcelocal/var/dfs/backup/DEVICE/link Oper=labeltape NReq=1 TNam=none TId=none
TAPE FILE: /opt/dcelocal/var/dfs/backup/DEVICE/data/none
Thanks, now proceeding with tape labelling operation.
Labelled tape <NULL> size 92160 Kbytes
Job 1: Labeltape (<NULL>) finished

bak> savedb 0
bak> Path=/opt/dcelocal/var/dfs/backup/DEVICE/link Oper=savedb NReq=1 TNam=bak_db_dump.1 TId=none
TAPE FILE: /opt/dcelocal/var/dfs/backup/DEVICE/data/bak_db_dump.1
Thanks, now proceeding with tape writing operation.
Tape accepted - now dumping database
Database dump completedsleep 2
jobs
Job 1: SaveDb
bak> sleep 10
Job 1: SaveDb finished
jobs
bak> sleep 10
jobs
bak> verifydb
Database OK
bak> status -tcid 0
Tape coordinator is idle
bak> readlabel -tcid 0

Path=/opt/dcelocal/var/dfs/backup/DEVICE/link Oper=readlabel NReq=1 TNam=none TId=none
TAPE FILE: /opt/dcelocal/var/dfs/backup/DEVICE/data/bak_db_dump.1
Thanks, now proceeding with tape label reading operation.
Job 1: ReadLabel finished
Tape read was labelled : bak_db_dump.1  size : 92160 Kbytes
Tape label
----------
name = 		bak_db_dump.1
createTime = 	Fri Nov  8 15:22:32 1996
cell = 		/.../power2.dce.transarc.com
size = 		92160 Kbytes
dump path = 	
dump id = 	0
useCount = 	1
-- End of tape label --

Path=/opt/dcelocal/var/dfs/backup/DEVICE/link Oper=unmount
bak> 
==========TEST START: restoredb-1b===========
cm checkfilesets
All backup filesets checked.
lshosts
Tape hosts:
    Host /.../power2.dce.transarc.com/hosts/power8, port offset 0
bak> rmhost 0
Deleting offset 0 from tape list...done
bak> lsftfamilies
Fileset family restoredb_test:
    Entry   1: server /.../power2.dce.transarc.com/hosts/power8, aggregate epi1, filesets: .*

bak> rmftfamily  restoredb_test
bak: deleted fileset family 'restoredb_test'
bak> lsdumps
/restoredb_test_full 
    /incr1 
        /incr11 
    /incr2 
bak> rmdump /restoredb_test_full
bak: deleted dump schedule /restoredb_test_full
bak> addhost /.../power2.dce.transarc.com/hosts/power8 0
Adding host '/.../power2.dce.transarc.com/hosts/power8' offset 0 to tape list...done
bak> spawn /opt/dcelocal/bin/butc -tcid 0 
Opened file /opt/dcelocal/var/dfs/backup/conf__opt_dcelocal_var_dfs_backup_DEVICE_link
Tape mount callout routine is /opt/dcelocal/var/dfs/backup/DEVICE/mount.sh
Tape unmount callout routine is /opt/dcelocal/var/dfs/backup/DEVICE/unmount.sh
Operator queries are disabled
Dump tape name check is enabled
Will dump to a file
Tape Coordinator:  TCID 0   Debug level 0   Cell /.../power2.dce.transarc.com
Butc started on  at tcid 0sleep 15
verifydb
Database OK
bak> status -tcid 0
Tape coordinator is idle
bak> readlabel -tcid 0
Path=/opt/dcelocal/var/dfs/backup/DEVICE/link Oper=readlabel NReq=1 TNam=none TId=none
TAPE FILE: /opt/dcelocal/var/dfs/backup/DEVICE/data/bak_db_dump.1
Thanks, now proceeding with tape label reading operation.
Job 1: ReadLabel finished
Tape read was labelled : bak_db_dump.1  size : 92160 Kbytes
Tape label
----------
name = 		bak_db_dump.1
createTime = 	Fri Nov  8 15:22:32 1996
cell = 		/.../power2.dce.transarc.com
size = 		92160 Kbytes
dump path = 	
dump id = 	0
useCount = 	1
-- End of tape label --

Path=/opt/dcelocal/var/dfs/backup/DEVICE/link Oper=unmount
bak> restoredb 
bak> Path=/opt/dcelocal/var/dfs/backup/DEVICE/link Oper=restoredb NReq=1 TNam=bak_db_dump.1 TId=none
TAPE FILE: /opt/dcelocal/var/dfs/backup/DEVICE/data/bak_db_dump.1
Thanks, now proceeding with tape reading operation.
Database restoration complete
sleep 2
Job 1: RestoreDb finished
jobs
bak> sleep 10
jobs
bak> lshosts
Obsolete tape hosts info in cache; Updating from database
Tape hosts:
    Host /.../power2.dce.transarc.com/hosts/power8, port offset 0
bak> lsftfamilies
Obsolete fileset family info in cache; Updating from database
Fileset family restoredb_test:
    Entry   1: server /.../power2.dce.transarc.com/hosts/power8, aggregate epi1, filesets: .*

bak> lsdumps
Obsolete dump schedule info in cache; Updating from database
/restoredb_test_full 
    /incr1 
        /incr11 
    /incr2 
bak> 
==========TEST RESULT: restoredb-1b     PASSED==========

==========TEST END: restoredb-1b===========

==========TEST START: restoredb-2.1b===========
cm checkfilesets
All backup filesets checked.
lshosts
Tape hosts:
    Host /.../power2.dce.transarc.com/hosts/power8, port offset 0
bak> rmhost 0
Deleting offset 0 from tape list...done
bak> lsftfamilies
Fileset family restoredb_test:
    Entry   1: server /.../power2.dce.transarc.com/hosts/power8, aggregate epi1, filesets: .*

bak> rmftfamily  restoredb_test
bak: deleted fileset family 'restoredb_test'
bak> lsdumps
/restoredb_test_full 
    /incr1 
        /incr11 
    /incr2 
bak> rmdump /restoredb_test_full
bak: deleted dump schedule /restoredb_test_full
bak> addhost /.../power2.dce.transarc.com/hosts/power8 0
Adding host '/.../power2.dce.transarc.com/hosts/power8' offset 0 to tape list...done
bak> spawn /opt/dcelocal/bin/butc -tcid 0 
Opened file /opt/dcelocal/var/dfs/backup/conf__opt_dcelocal_var_dfs_backup_DEVICE_link
Tape mount callout routine is /opt/dcelocal/var/dfs/backup/DEVICE/mount.sh
Tape unmount callout routine is /opt/dcelocal/var/dfs/backup/DEVICE/unmount.sh
Operator queries are disabled
Dump tape name check is enabled
Will dump to a file
Tape Coordinator:  TCID 0   Debug level 0   Cell /.../power2.dce.transarc.com
Butc started on  at tcid 0sleep 15
verifydb
Database OK
bak> status -tcid 0
Tape coordinator is idle
bak> readlabel -tcid 0
Path=/opt/dcelocal/var/dfs/backup/DEVICE/link Oper=readlabel NReq=1 TNam=none TId=none
TAPE FILE: /opt/dcelocal/var/dfs/backup/DEVICE/data/bak_db_dump.1
Thanks, now proceeding with tape label reading operation.
Job 1: ReadLabel finished
Tape read was labelled : bak_db_dump.1  size : 92160 Kbytes
Tape label
----------
name = 		bak_db_dump.1
createTime = 	Fri Nov  8 15:22:32 1996
cell = 		/.../power2.dce.transarc.com
size = 		92160 Kbytes
dump path = 	
dump id = 	0
useCount = 	1
-- End of tape label --

bak> restoredb 0
bak> Path=/opt/dcelocal/var/dfs/backup/DEVICE/link Oper=unmount
Path=/opt/dcelocal/var/dfs/backup/DEVICE/link Oper=restoredb NReq=1 TNam=bak_db_dump.1 TId=none
TAPE FILE: /opt/dcelocal/var/dfs/backup/DEVICE/data/bak_db_dump.1
Thanks, now proceeding with tape reading operation.
Database restoration complete
sleep 2
Job 1: RestoreDb finished
jobs
bak> sleep 10
jobs
bak> lshosts
Obsolete tape hosts info in cache; Updating from database
Tape hosts:
    Host /.../power2.dce.transarc.com/hosts/power8, port offset 0
bak> lsftfamilies
Obsolete fileset family info in cache; Updating from database
Fileset family restoredb_test:
    Entry   1: server /.../power2.dce.transarc.com/hosts/power8, aggregate epi1, filesets: .*

bak> lsdumps
Obsolete dump schedule info in cache; Updating from database
/restoredb_test_full 
    /incr1 
        /incr11 
    /incr2 
bak> 
==========TEST RESULT: restoredb-2.1b     PASSED==========

==========TEST END: restoredb-2.1b===========

==========TEST START: restoredb-2.2b===========
cm checkfilesets
All backup filesets checked.
lshosts
Tape hosts:
    Host /.../power2.dce.transarc.com/hosts/power8, port offset 0
bak> rmhost 0
Deleting offset 0 from tape list...done
bak> lsftfamilies
Fileset family restoredb_test:
    Entry   1: server /.../power2.dce.transarc.com/hosts/power8, aggregate epi1, filesets: .*

bak> rmftfamily  restoredb_test
bak: deleted fileset family 'restoredb_test'
bak> lsdumps
/restoredb_test_full 
    /incr1 
        /incr11 
    /incr2 
bak> rmdump /restoredb_test_full
bak: deleted dump schedule /restoredb_test_full
bak> addhost /.../power2.dce.transarc.com/hosts/power8 1
Adding host '/.../power2.dce.transarc.com/hosts/power8' offset 1 to tape list...done
bak> spawn /opt/dcelocal/bin/butc -tcid 1 
Opened file /opt/dcelocal/var/dfs/backup/conf__opt_dcelocal_var_dfs_backup_DEVICE_link
Tape mount callout routine is /opt/dcelocal/var/dfs/backup/DEVICE/mount.sh
Tape unmount callout routine is /opt/dcelocal/var/dfs/backup/DEVICE/unmount.sh
Operator queries are disabled
Dump tape name check is enabled
Will dump to a file
Tape Coordinator:  TCID 1   Debug level 0   Cell /.../power2.dce.transarc.com
Butc started on  at tcid 1sleep 15
verifydb
Database OK
bak> status -tcid 1
Tape coordinator is idle
bak> readlabel -tcid 1
Path=/opt/dcelocal/var/dfs/backup/DEVICE/link Oper=readlabel NReq=1 TNam=none TId=none
TAPE FILE: /opt/dcelocal/var/dfs/backup/DEVICE/data/bak_db_dump.1
Thanks, now proceeding with tape label reading operation.
Job 1: ReadLabel finished
Tape read was labelled : bak_db_dump.1  size : 92160 Kbytes
Tape label
----------
name = 		bak_db_dump.1
createTime = 	Fri Nov  8 15:22:32 1996
cell = 		/.../power2.dce.transarc.com
size = 		92160 Kbytes
dump path = 	
dump id = 	0
useCount = 	1
-- End of tape label --

Path=/opt/dcelocal/var/dfs/backup/DEVICE/link Oper=unmount
bak> restoredb 1
bak> Path=/opt/dcelocal/var/dfs/backup/DEVICE/link Oper=restoredb NReq=1 TNam=bak_db_dump.1 TId=none
TAPE FILE: /opt/dcelocal/var/dfs/backup/DEVICE/data/bak_db_dump.1
Thanks, now proceeding with tape reading operation.
Database restoration complete
sleep 2
jobs
Job 1: RestoreDb
bak> sleep 10
Job 1: RestoreDb finished
jobs
bak> sleep 10
jobs
bak> lshosts
Obsolete tape hosts info in cache; Updating from database
Tape hosts:
    Host /.../power2.dce.transarc.com/hosts/power8, port offset 0
bak> lsftfamilies
Obsolete fileset family info in cache; Updating from database
Fileset family restoredb_test:
    Entry   1: server /.../power2.dce.transarc.com/hosts/power8, aggregate epi1, filesets: .*

bak> lsdumps
Obsolete dump schedule info in cache; Updating from database
/restoredb_test_full 
    /incr1 
        /incr11 
    /incr2 
bak> 
==========TEST RESULT: restoredb-2.2b     PASSED==========

==========TEST END: restoredb-2.2b===========

==========TEST START: restoredb-2.3b===========
cm checkfilesets
All backup filesets checked.
lshosts
Tape hosts:
    Host /.../power2.dce.transarc.com/hosts/power8, port offset 0
bak> rmhost 0
Deleting offset 0 from tape list...done
bak> lsftfamilies
Fileset family restoredb_test:
    Entry   1: server /.../power2.dce.transarc.com/hosts/power8, aggregate epi1, filesets: .*

bak> rmftfamily  restoredb_test
bak: deleted fileset family 'restoredb_test'
bak> lsdumps
/restoredb_test_full 
    /incr1 
        /incr11 
    /incr2 
bak> rmdump /restoredb_test_full
bak: deleted dump schedule /restoredb_test_full
bak> addhost /.../power2.dce.transarc.com/hosts/power8 1023
Adding host '/.../power2.dce.transarc.com/hosts/power8' offset 1023 to tape list...done
bak> spawn /opt/dcelocal/bin/butc -tcid 1023 
Opened file /opt/dcelocal/var/dfs/backup/conf__opt_dcelocal_var_dfs_backup_DEVICE_link
Tape mount callout routine is /opt/dcelocal/var/dfs/backup/DEVICE/mount.sh
Tape unmount callout routine is /opt/dcelocal/var/dfs/backup/DEVICE/unmount.sh
Operator queries are disabled
Dump tape name check is enabled
Will dump to a file
Tape Coordinator:  TCID 1023   Debug level 0   Cell /.../power2.dce.transarc.com
Butc started on  at tcid 1023sleep 15
verifydb
Database OK
bak> status -tcid 1023
Tape coordinator is idle
bak> readlabel -tcid 1023
Path=/opt/dcelocal/var/dfs/backup/DEVICE/link Oper=readlabel NReq=1 TNam=none TId=none
TAPE FILE: /opt/dcelocal/var/dfs/backup/DEVICE/data/bak_db_dump.1
Thanks, now proceeding with tape label reading operation.
Job 1: ReadLabel finished
Tape read was labelled : bak_db_dump.1  size : 92160 Kbytes
Tape label
----------
name = 		bak_db_dump.1
createTime = 	Fri Nov  8 15:22:32 1996
cell = 		/.../power2.dce.transarc.com
size = 		92160 Kbytes
dump path = 	
dump id = 	0
useCount = 	1
-- End of tape label --

Path=/opt/dcelocal/var/dfs/backup/DEVICE/link Oper=unmount
bak> restoredb 1023
bak> Path=/opt/dcelocal/var/dfs/backup/DEVICE/link Oper=restoredb NReq=1 TNam=bak_db_dump.1 TId=none
TAPE FILE: /opt/dcelocal/var/dfs/backup/DEVICE/data/bak_db_dump.1
Thanks, now proceeding with tape reading operation.
Database restoration complete
sleep 2
jobs
Job 1: RestoreDb
bak> sleep 10
Job 1: RestoreDb finished
jobs
bak> sleep 10
jobs
bak> lshosts
Obsolete tape hosts info in cache; Updating from database
Tape hosts:
    Host /.../power2.dce.transarc.com/hosts/power8, port offset 0
bak> lsftfamilies
Obsolete fileset family info in cache; Updating from database
Fileset family restoredb_test:
    Entry   1: server /.../power2.dce.transarc.com/hosts/power8, aggregate epi1, filesets: .*

bak> lsdumps
Obsolete dump schedule info in cache; Updating from database
/restoredb_test_full 
    /incr1 
        /incr11 
    /incr2 
bak> 
==========TEST RESULT: restoredb-2.3b     PASSED==========

==========TEST END: restoredb-2.3b===========

==========TEST START: restoredb-2.1.1e===========
cm checkfilesets
All backup filesets checked.
verifydb
Database OK
bak> restoredb 666
bak: Unknown code DFS:bk 21 (543465493) ; Unable to connect to tape coordinator at port 666
bak> 
==========TEST RESULT: restoredb-2.1.1e     PASSED==========

==========TEST END: restoredb-2.1.1e===========

==========TEST START: restoredb-2.1.2e===========
cm checkfilesets
All backup filesets checked.
lshosts
Tape hosts:
    Host /.../power2.dce.transarc.com/hosts/power8, port offset 0
bak> rmhost 1023
Deleting offset 1023 from tape list...failed
bak: Unknown code DFS:bk 19 (543465491) ; Unable to delete tape host
bak> addhost /.../power2.dce.transarc.com/hosts/power8 1023
Adding host '/.../power2.dce.transarc.com/hosts/power8' offset 1023 to tape list...done
bak> lshosts
Tape hosts:
    Host /.../power2.dce.transarc.com/hosts/power8, port offset 0
    Host /.../power2.dce.transarc.com/hosts/power8, port offset 1023
bak> verifydb
Database OK
bak> /bin/grep " 1023" /opt/dcelocal/var/dfs/backup/TapeConfig
90M 200K /opt/dcelocal/var/dfs/backup/DEVICE/link 1023
status -tcid 1023
bak: Communications failure (dce / rpc) ; Unable to contact tape coordinator at tcid 1023
bak> sleep 10
status -tcid 1023
bak: Communications failure (dce / rpc) ; Unable to contact tape coordinator at tcid 1023
bak> sleep 10
status -tcid 1023
bak: Communications failure (dce / rpc) ; Unable to contact tape coordinator at tcid 1023
bak> sleep 10
restoredb 1023
bak: Communications failure (dce / rpc) ; Unable to contact tape coordinator at port 1023
bak> 
==========TEST RESULT: restoredb-2.1.2e     PASSED==========

==========TEST END: restoredb-2.1.2e===========

==========TEST START: restoredb-2.2e===========
cm checkfilesets
All backup filesets checked.
verifydb
Database OK
bak> restoredb -666
bak: Unknown code DFS:bk 17 (543465489) ; Unable to parse tcid '-666'
bak> 
==========TEST RESULT: restoredb-2.2e     PASSED==========

==========TEST END: restoredb-2.2e===========

==========TEST START: restoredb-2.3e===========
cm checkfilesets
All backup filesets checked.
verifydb
Database OK
bak> restoredb 1024
bak: Unknown code DFS:bk 17 (543465489) ; 1024 exceeds max port offset 1023
bak> 
==========TEST RESULT: restoredb-2.3e     PASSED==========

==========TEST END: restoredb-2.3e===========
verifydb
Database OK
bak> /opt/dcelocal/bin/bos stop /.:/hosts/power2 bakserver
/opt/dcelocal/bin/bos stop /.:/hosts/power8 bakserver
spawn telnet power2 
Trying...
Connected to power2.transarc.com.
Escape character is '^]'.


telnet (power2)


























AIX Version 3
(C) Copyrights by IBM and by others 1982, 1993.
login: rootl
rootl's Password:

        This is POWER2, a DFS Development RS/6000.
        It sits in room 1901.

        11/18/94 shl    Installed AIX 3.2.5 + AFS 3.3a
                        + Austin-recommended PTFs for DCE 1.3


Last unsuccessful login: Wed Nov  6 19:16:20 EST 1996 on pts/1 from 129.35.102.89
Last login: Fri Nov  8 16:16:36 EST 1996 on pts/6 from power8.transarc.com
# sleep 10
/bin/csh
# set prompt="##TEST## "
##TEST## /bin/rm /opt/dcelocal/var/dfs/backup/bkdb.DB0 /opt/dcelocal/var/dfs/backup/bkdb.DBSYS1
##TEST## /bin/echo $status
0
##TEST## spawn telnet power8 
Trying...
Connected to power8.transarc.com.
Escape character is '^]'.


AIX telnet (power8.transarc.com)


























AIX Version 3
(C) Copyrights by IBM and by others 1982, 1993.
login: rootl
rootl's Password:
*******************************************************************************
*                       Welcome to AIX Version 3.2!                           *
*                                                                             *
*******************************************************************************

        This is power8.transarc.com and belongs to DFS Group.

        Please contact Srinivas Kotla (x6863) for any questions.



Last unsuccessful login: Tue Oct 29 11:49:57 1996 on pts/4 from 129.35.102.68
Last login: Fri Nov  8 15:17:19 1996 on pts/11
# sleep 10
/bin/csh
# set prompt="##TEST## "
##TEST## /bin/rm /opt/dcelocal/var/dfs/backup/bkdb.DB0 /opt/dcelocal/var/dfs/backup/bkdb.DBSYS1
##TEST## /bin/echo $status
0
##TEST## /bin/mv /opt/dcelocal/var/dfs/backup/restoredb-cmd/bkdb.DB0 /opt/dcelocal/var/dfs/backup/restoredb-cmd/bkdb.DBSYS1 /opt/dcelocal/var/dfs/backup
/bin/rmdir /opt/dcelocal/var/dfs/backup/restoredb-cmd
/opt/dcelocal/bin/bos start /.:/hosts/power2 bakserver
/opt/dcelocal/bin/bos start /.:/hosts/power8 bakserver
sleep 200
spawn /opt/dcelocal/bin/bak 
bak> jobs
bak> verifydb
Database OK
bak> 
==========COMMAND END: restoredb==========

generic-post

generic-cleanup
