
SCRIPT FOR ACTIVITY ON CLIENT IN REQUESTING CELL.
ANNOTATED.

Script started on Tue Dec 10 10:50:18 EST 1996

PART A TEST 1

[GLOBALGROUP.TEST] cat tfile
cat: cannot open tfile

TEST 1 PASS

TEST 2

[GLOBALGROUP.TEST] cat tfile
testing

TEST 2 PASS

TEST 3

[GLOBALGROUP.TEST] cat>>tfile
tfile: Permission denied

TEST 3 PASS

TEST 4

[GLOBALGROUP.TEST] acl_edit tfile
sec_acl_edit> l
# SEC_ACL for tfile:
# Default cell = /.../gemini.dce.transarc.com
mask_obj:r-----
user_obj:rw-c--
group_obj:r-----
group:testgroup2:r-----
other_obj:------
sec_acl_edit> m other_obj:r-----
sec_acl_edit> e
ERROR: operation on acl not authorized (dce / sec)
[GLOBALGROUP.TEST]

TEST 4 PASS

TEST 5

[GLOBALGROUP.TEST] cat>>tfile
another test
[GLOBALGROUP.TEST] cat tfile
testing
another test

TEST 5 PASS

TEST 6

[GLOBALGROUP.TEST] acl_edit tfile
sec_acl_edit>  m other_obj:r-----
sec_acl_edit> co
ERROR: operation on acl not authorized (dce / sec)
sec_acl_edit> e
ERROR: operation on acl not authorized (dce / sec)

TEST 6 PASS

TEST 7

[GLOBALGROUP.TEST] acl_edit tfile
sec_acl_edit>  m other_obj:r-----
sec_acl_edit> co
sec_acl_edit> e

TEST 7 PASS

PART B TEST 1

[GLOBALGROUP.TEST] ls tdir
tdir unreadable

TEST 1 PASS

TEST 2

[GLOBALGROUP.TEST] ls tdir
tfile

TEST 2 PASS

TEST 3

[GLOBALGROUP.TEST] touch tdir/tfile2
[GLOBALGROUP.TEST] ls -l tdir
total 0
-rw-r--r--   1 5900     1201           0 Dec 10 12:28 tfile
-rw-r--r--   1 5900     1201           0 Dec 10 12:31 tfile2

TEST 3 PASS

TEST 4

[GLOBALGROUP.TEST] rm tdir/tfile
rm: remove tdir/tfile? y
[GLOBALGROUP.TEST] ls tdir
tfile2

TEST 4 PASS

TEST 5

[GLOBALGROUP.TEST] acl_edit tdir
sec_acl_edit> l
# SEC_ACL for tdir:
# Default cell = /.../gemini.dce.transarc.com
mask_obj:rwxcid
user_obj:rwxcid
group_obj:r-x---
group:testgroup2:rwxcid
other_obj:r-x---
sec_acl_edit> m other_obj:rwxcid
sec_acl_edit> co
sec_acl_edit> l
# SEC_ACL for tdir:
# Default cell = /.../gemini.dce.transarc.com
mask_obj:rwxcid
user_obj:rwxcid
group_obj:r-x---
group:testgroup2:rwxcid
other_obj:rwxcid
sec_acl_edit> e

TEST 5 PASS

[GLOBALGROUP.TEST]

DONE
